In [11]:
for i in range(1,10):
    for j in range(2):
        i += 1
        print(i/j)
        j+=1

ZeroDivisionError: division by zero

In [7]:
2917/3000

0.9723333333333334

In [18]:
i += 1

In [14]:
i= 0

In [19]:
i

2

In [20]:
i[0]

TypeError: 'int' object is not subscriptable

In [ ]:
if i = 0 and j = 0
    divide

In [24]:
import pandas as pd

my_list = [1, 2, 3, 4, 5]
list1 = [25,546,54,1,2]
df = pd.DataFrame({'my_column': my_list,'my_row':list1})
print(df)

   my_column  my_row
0          1      25
1          2     546
2          3      54
3          4       1
4          5       2

In [101]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({
    'Name': ['Karen','Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 98,35, 40],
    'Salary': ['$50000.00','$112', "$60000", "$70000", "$80000"]
})

# print the original dataframe
print(df)

# reset the index
df = df.set_index('Name')

# print the dataframe without index
print(df)

      Name  Age     Salary
0    Karen   25  $50000.00
1    Alice   30       $112
2      Bob   98     $60000
3  Charlie   35     $70000
4    David   40     $80000
         Age     Salary
Name
Karen     25  $50000.00
Alice     30       $112
Bob       98     $60000
Charlie   35     $70000
David     40     $80000

In [36]:
df['Salary'].astype(str)

Name
Alice      $50000.00
Bob           $60000
Charlie       $70000
David         $80000
Name: Salary, dtype: object

In [40]:
sa = []
for i in df['Salary']:
#     print(i.split('$'))
    temp = i.split('$')
    sa.append(float(temp[1]))
print(sa)

[50000.0, 60000.0, 70000.0, 80000.0]

In [16]:
k = "&89887"

In [29]:
h = k.split('&')

In [31]:
h[1]

'89887'

#

In [84]:
l =  [1,2,3,4]

In [85]:
df['New'] = l

In [90]:
df

         Age     Salary  New
Name
Alice     25  $50000.00    1
Bob       30     $60000    2
Charlie   35     $70000    3
David     40     $80000    4

In [93]:
df.drop(labels='New',axis=1)

         Age     Salary
Name
Alice     25  $50000.00
Bob       30     $60000
Charlie   35     $70000
David     40     $80000

In [97]:
df['Salary'].

dtype('O')

In [108]:
df.sort_values(by="Name")

         Age     Salary
Name
Alice     30       $112
Bob       98     $60000
Charlie   35     $70000
David     40     $80000
Karen     25  $50000.00

In [107]:
k

         Age     Salary
Name
Alice     30       $112
Bob       98     $60000
Charlie   35     $70000
David     40     $80000
Karen     25  $50000.00